system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         foamRun;

solver              incompressibleFluid;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             0.03;

deltaT              0.0001;

writeControl        adjustableRunTime;

writeInterval       0.001;

purgeWrite          0;

writeFormat         ascii;

writePrecision      6;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   true;

adjustTimeStep      true;

maxCo               5;

    functions
    {
    #includeFunc  residuals
    }
// ************************************************************************* //
