system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (50 -20 -1) // 0
    (0 -20 -1)  // 1
    (-10 -5 -1) // 2
    (-10 5 -1)  // 3
    (0 20 -1)   // 4
    (50 20 -1)  // 5
    (60 5 -1)   // 6
    (60 -5 -1)  // 7
    (50 -20 1) // 8
    (0 -20 1)  // 9
    (-10 -5 1) // 10
    (-10 5 1)  // 11
    (0 20 1)   // 12
    (50 20 1)  // 13
    (60 5 1)   // 14
    (60 -5 1)  // 15
);

blocks
(
    hex (10 2 3 11 9 1 4 12) (1 200 400) simpleGrading (1 1 1)
    hex (9 1 4 12 8 0 5 13) (1 200 400) simpleGrading (1 1 1)
    hex (8 0 5 13 15 7 6 14) (1 200 400) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 3 11 10)
        );
    }
//
    outlet
    {
        type patch;
        faces
        (
            (6 7 15 14)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (4 12 11 3)
            (4 5 13 12)
            (13 5 6 14)
            (1 2 10 9)
            (1 9 8 0)
            (0 8 15 7)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (1 2 3 4)
            (0 1 4 5)
            (5 6 7 0)
            (12 11 10 9)
            (13 12 9 8)
            (15 14 13 8)
        );
    }
);

// ************************************************************************* //
